In [3]:
import pandas as pd
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
dfc = pd.read_csv('calendar.csv')
dfl = pd.read_csv('listings.csv')
dfr = pd.read_csv('reviews.csv')

In [5]:
dfc.head()

   listing_id        date available   price
0      241032  2016-01-04         t  $85.00
1      241032  2016-01-05         t  $85.00
2      241032  2016-01-06         f     NaN
3      241032  2016-01-07         f     NaN
4      241032  2016-01-08         f     NaN

In [7]:
# ubah format data
dfc['date'] = pd.to_datetime(dfc['date'], format='%Y-%m-%d')
# Tambahkan kolom bulan dan tahun
dfc['bulan'] = dfc['date'].dt.month
dfc['tahun'] = dfc['date'].dt.year

In [9]:
dfc.head()

   listing_id       date available   price  bulan  tahun
0      241032 2016-01-04         t  $85.00      1   2016
1      241032 2016-01-05         t  $85.00      1   2016
2      241032 2016-01-06         f     NaN      1   2016
3      241032 2016-01-07         f     NaN      1   2016
4      241032 2016-01-08         f     NaN      1   2016

In [11]:
dfc['bulan'] = dfc['date'].dt.strftime('%B')  # '%B' menghasilkan nama bulan dalam teks

In [13]:
dfc.head()

   listing_id       date available   price    bulan  tahun
0      241032 2016-01-04         t  $85.00  January   2016
1      241032 2016-01-05         t  $85.00  January   2016
2      241032 2016-01-06         f     NaN  January   2016
3      241032 2016-01-07         f     NaN  January   2016
4      241032 2016-01-08         f     NaN  January   2016

In [15]:
dfc['price'] = dfc['price'].str.replace('$', '').str.replace(',', '').astype(float)

In [17]:
dfc = dfc.rename({'price': 'payment'}, axis=1)

In [19]:
dfc.head()

   listing_id       date available  payment    bulan  tahun
0      241032 2016-01-04         t     85.0  January   2016
1      241032 2016-01-05         t     85.0  January   2016
2      241032 2016-01-06         f      NaN  January   2016
3      241032 2016-01-07         f      NaN  January   2016
4      241032 2016-01-08         f      NaN  January   2016

In [21]:
# buang null
dfc_cleaned = dfc.dropna()

In [23]:
# Hitung median price per bulan untuk tiap id, dan jumlah id di setiap bulan-tahun
dfcg = dfc_cleaned.groupby(['listing_id', 'tahun', 'bulan']).agg(
    median_price=('payment', 'median'),
    jumlah_id=('listing_id', 'size')
).reset_index()

In [25]:
dfcg

       listing_id  tahun      bulan  median_price  jumlah_id
0            3335   2016      April         120.0         30
1            3335   2016     August         120.0         31
2            3335   2016   December         120.0         31
3            3335   2016   February         120.0          1
4            3335   2016       July         120.0         31
...           ...    ...        ...           ...        ...
36110    10340165   2016        May          43.0         31
36111    10340165   2016   November          43.0         30
36112    10340165   2016    October          43.0         31
36113    10340165   2016  September          43.0         30
36114    10340165   2017    January          43.0          2

[36115 rows x 5 columns]

In [27]:
# Gabungkan kolom 'bulan' dan 'tahun' menjadi satu kolom 'tahun_bulan'
dfcg['tahun_bulan'] = dfcg['bulan'] + ' ' + dfcg['tahun'].astype(str)

In [30]:
dfcg

       listing_id  tahun      bulan  median_price  jumlah_id     tahun_bulan
0            3335   2016      April         120.0         30      April 2016
1            3335   2016     August         120.0         31     August 2016
2            3335   2016   December         120.0         31   December 2016
3            3335   2016   February         120.0          1   February 2016
4            3335   2016       July         120.0         31       July 2016
...           ...    ...        ...           ...        ...             ...
36110    10340165   2016        May          43.0         31        May 2016
36111    10340165   2016   November          43.0         30   November 2016
36112    10340165   2016    October          43.0         31    October 2016
36113    10340165   2016  September          43.0         30  September 2016
36114    10340165   2017    January          43.0          2    January 2017

[36115 rows x 6 columns]

In [32]:
# di sort perbulan
dfcg = dfcg.sort_values(by=['listing_id','bulan', 'tahun'])
dfcg

       listing_id  tahun      bulan  median_price  jumlah_id     tahun_bulan
0            3335   2016      April         120.0         30      April 2016
1            3335   2016     August         120.0         31     August 2016
2            3335   2016   December         120.0         31   December 2016
3            3335   2016   February         120.0          1   February 2016
11           3335   2017    January         120.0          2    January 2017
...           ...    ...        ...           ...        ...             ...
36109    10340165   2016      March          43.0         31      March 2016
36110    10340165   2016        May          43.0         31        May 2016
36111    10340165   2016   November          43.0         30   November 2016
36112    10340165   2016    October          43.0         31    October 2016
36113    10340165   2016  September          43.0         30  September 2016

[36115 rows x 6 columns]

In [34]:
# Membuat dictionary untuk memetakan nama bulan ke angka
month_mapping = {
    'January': 1,
    'February': 2,
    'March': 3,
    'April': 4,
    'May': 5,
    'June': 6,
    'July': 7,
    'August': 8,
    'September': 9,
    'October': 10,
    'November': 11,
    'December': 12
}

In [36]:
# Menambahkan kolom bulan numerik
dfcg['bulan_num'] = dfcg['bulan'].map(month_mapping)

In [38]:
df1 = dfcg.sort_values(by=['listing_id','tahun', 'bulan_num'])
df1.head()

,listing_id,tahun,bulan,median_price,jumlah_id,tahun_bulan,bulan_num
3,3335,2016,February,120.0,1,February 2016,2
6,3335,2016,March,120.0,31,March 2016,3
0,3335,2016,April,120.0,30,April 2016,4
7,3335,2016,May,120.0,31,May 2016,5
5,3335,2016,June,120.0,30,June 2016,6

In [40]:
df1 = df1[['listing_id','tahun','bulan','bulan_num','median_price','jumlah_id']]

In [42]:
df1.head()

   listing_id  tahun     bulan  bulan_num  median_price  jumlah_id
3        3335   2016  February          2         120.0          1
6        3335   2016     March          3         120.0         31
0        3335   2016     April          4         120.0         30
7        3335   2016       May          5         120.0         31
5        3335   2016      June          6         120.0         30

In [44]:
#rename id jadi listing_id
dfl = dfl.rename({'id': 'listing_id'}, axis=1)

#ambil kolom yang diperlukan
dfl2 = dfl[['listing_id','name','host_id','host_response_time','host_response_rate','host_acceptance_rate','host_is_superhost','host_identity_verified','zipcode','latitude','longitude','is_location_exact','property_type','room_type','accommodates','bathrooms','bedrooms','beds','bed_type','price','weekly_price','monthly_price','guests_included','minimum_nights','maximum_nights','review_scores_rating', 'review_scores_accuracy','review_scores_cleanliness','review_scores_checkin','review_scores_communication','review_scores_location','review_scores_value','instant_bookable','cancellation_policy','require_guest_profile_picture','require_guest_phone_verification']]

In [46]:
# Mengubah data yang bertipe string ke float
dfl2['price'] = dfl2['price'].str.replace('$', '').str.replace(',', '').astype(float)
dfl2['weekly_price'] = dfl2['weekly_price'].str.replace('$', '').str.replace(',', '').astype(float)
dfl2['monthly_price'] = dfl2['monthly_price'].str.replace('$', '').str.replace(',', '').astype(float)
dfl2['host_response_rate'] = dfl2['host_response_rate'].str.replace('%', '').astype(float)
dfl2['host_acceptance_rate'] = dfl2['host_acceptance_rate'].str.replace('%', '').astype(float)

# Mengubah data yang beripe integer ke string
dfl2['host_id'] = dfl2['host_id'].astype(str)
dfl2['latitude'] = dfl2['latitude'].astype(str)
dfl2['longitude'] = dfl2['longitude'].astype(str)

C:\Users\Indah\AppData\Local\Temp\ipykernel_14428\2586953589.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dfl2['price'] = dfl2['price'].str.replace('$', '').str.replace(',', '').astype(float)
C:\Users\Indah\AppData\Local\Temp\ipykernel_14428\2586953589.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dfl2['weekly_price'] = dfl2['weekly_price'].str.replace('$', '').str.replace(',', '').astype(float)
C:\Users\Indah\AppData\Local\Temp\ipykernel_14428\2586953589.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dfl2['monthly_price'] = dfl2['monthly_price'].str.replace('$', '').str.replace(',', '').astype(float)
C:\Users\Indah\AppData\Local\Temp\ipykernel_14428\2586953589.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dfl2['host_response_rate'] = dfl2['host_response_rate'].str.replace('%', '').astype(float)
C:\Users\Indah\AppData\Local\Temp\ipykernel_14428\2586953589.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dfl2['host_acceptance_rate'] = dfl2['host_acceptance_rate'].str.replace('%', '').astype(float)
C:\Users\Indah\AppData\Local\Temp\ipykernel_14428\2586953589.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dfl2['host_id'] = dfl2['host_id'].astype(str)
C:\Users\Indah\AppData\Local\Temp\ipykernel_14428\2586953589.py:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dfl2['latitude'] = dfl2['latitude'].astype(str)
C:\Users\Indah\AppData\Local\Temp\ipykernel_14428\2586953589.py:11: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dfl2['longitude'] = dfl2['longitude'].astype(str)

In [48]:
dfl2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3818 entries, 0 to 3817
Data columns (total 36 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   listing_id                        3818 non-null   int64
 1   name                              3818 non-null   object
 2   host_id                           3818 non-null   object
 3   host_response_time                3295 non-null   object
 4   host_response_rate                3295 non-null   float64
 5   host_acceptance_rate              3045 non-null   float64
 6   host_is_superhost                 3816 non-null   object
 7   host_identity_verified            3816 non-null   object
 8   zipcode                           3811 non-null   object
 9   latitude                          3818 non-null   object
 10  longitude                         3818 non-null   object
 11  is_location_exact                 3818 non-null   object
 12  property_type                     3817 non-null   object
 13  room_type                         3818 non-null   object
 14  accommodates                      3818 non-null   int64
 15  bathrooms                         3802 non-null   float64
 16  bedrooms                          3812 non-null   float64
 17  beds                              3817 non-null   float64
 18  bed_type                          3818 non-null   object
 19  price                             3818 non-null   float64
 20  weekly_price                      2009 non-null   float64
 21  monthly_price                     1517 non-null   float64
 22  guests_included                   3818 non-null   int64
 23  minimum_nights                    3818 non-null   int64
 24  maximum_nights                    3818 non-null   int64
 25  review_scores_rating              3171 non-null   float64
 26  review_scores_accuracy            3160 non-null   float64
 27  review_scores_cleanliness         3165 non-null   float64
 28  review_scores_checkin             3160 non-null   float64
 29  review_scores_communication       3167 non-null   float64
 30  review_scores_location            3163 non-null   float64
 31  review_scores_value               3162 non-null   float64
 32  instant_bookable                  3818 non-null   object
 33  cancellation_policy               3818 non-null   object
 34  require_guest_profile_picture     3818 non-null   object
 35  require_guest_phone_verification  3818 non-null   object
dtypes: float64(15), int64(5), object(16)
memory usage: 1.0+ MB

In [50]:
dfcg2 = dfcg [['listing_id', 'jumlah_id']]

In [52]:
dfcg2

       listing_id  jumlah_id
0            3335         30
1            3335         31
2            3335         31
3            3335          1
11           3335          2
...           ...        ...
36109    10340165         31
36110    10340165         31
36111    10340165         30
36112    10340165         31
36113    10340165         30

[36115 rows x 2 columns]

In [54]:
dfcg3 = dfcg2.groupby(['listing_id']).agg(jumlah_id=('jumlah_id', 'sum')).reset_index()

In [56]:
dfcg3

      listing_id  jumlah_id
0           3335        309
1           4291        365
2           5682        309
3           6606        365
4           7369         53
...          ...        ...
3718    10331249        354
3719    10332096        365
3720    10334184        361
3721    10339145        365
3722    10340165        358

[3723 rows x 2 columns]

In [58]:
# Menggabungkan dfcg3 dan dfl2 berdasarkan 'listing_id dengan tujuan memembuat kolom jumlah_id di dataset listing
dfl3 = pd.merge(dfcg3, dfl2, on='listing_id', how='left')
dfl3.head()

,listing_id,jumlah_id,name,host_id,host_response_time,host_response_rate,host_acceptance_rate,host_is_superhost,host_identity_verified,zipcode,...,review_scores_accuracy,review_scores_cleanliness,review_scores_checkin,review_scores_communication,review_scores_location,review_scores_value,instant_bookable,cancellation_policy,require_guest_profile_picture,require_guest_phone_verification
0,3335,309,Sweet Seattle Urban Homestead 2 Bdr,4193,within a few hours,88.0,100.0,f,t,98118,...,NaN,NaN,NaN,NaN,NaN,NaN,f,strict,f,f
1,4291,365,Sunrise in Seattle Master Suite,35749,within a day,100.0,100.0,f,t,98115,...,10.0,9.0,10.0,9.0,9.0,9.0,f,moderate,f,f
2,5682,309,"Cozy Studio, min. to downtown -WiFi",8993,within an hour,100.0,100.0,f,t,98106,...,10.0,10.0,10.0,10.0,9.0,10.0,t,strict,f,t
3,6606,365,"Fab, private seattle urban cottage!",14942,within a few hours,90.0,100.0,f,t,98103,...,9.0,9.0,10.0,9.0,10.0,9.0,f,strict,f,f
4,7369,53,launchingpad/landingpad,19425,NaN,NaN,NaN,f,f,98122,...,10.0,10.0,10.0,10.0,10.0,9.0,f,flexible,f,f

In [60]:
df2 = dfl3

In [59]:
#df1 = data calendar final
#df2 = data listing final

In [62]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 36115 entries, 3 to 36114
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   listing_id    36115 non-null  int64
 1   tahun         36115 non-null  int32
 2   bulan         36115 non-null  object
 3   bulan_num     36115 non-null  int64
 4   median_price  36115 non-null  float64
 5   jumlah_id     36115 non-null  int64
dtypes: float64(1), int32(1), int64(3), object(1)
memory usage: 1.8+ MB

In [64]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3723 entries, 0 to 3722
Data columns (total 37 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   listing_id                        3723 non-null   int64
 1   jumlah_id                         3723 non-null   int64
 2   name                              3723 non-null   object
 3   host_id                           3723 non-null   object
 4   host_response_time                3243 non-null   object
 5   host_response_rate                3243 non-null   float64
 6   host_acceptance_rate              3000 non-null   float64
 7   host_is_superhost                 3721 non-null   object
 8   host_identity_verified            3721 non-null   object
 9   zipcode                           3716 non-null   object
 10  latitude                          3723 non-null   object
 11  longitude                         3723 non-null   object
 12  is_location_exact                 3723 non-null   object
 13  property_type                     3722 non-null   object
 14  room_type                         3723 non-null   object
 15  accommodates                      3723 non-null   int64
 16  bathrooms                         3707 non-null   float64
 17  bedrooms                          3717 non-null   float64
 18  beds                              3722 non-null   float64
 19  bed_type                          3723 non-null   object
 20  price                             3723 non-null   float64
 21  weekly_price                      1973 non-null   float64
 22  monthly_price                     1492 non-null   float64
 23  guests_included                   3723 non-null   int64
 24  minimum_nights                    3723 non-null   int64
 25  maximum_nights                    3723 non-null   int64
 26  review_scores_rating              3101 non-null   float64
 27  review_scores_accuracy            3090 non-null   float64
 28  review_scores_cleanliness         3095 non-null   float64
 29  review_scores_checkin             3090 non-null   float64
 30  review_scores_communication       3097 non-null   float64
 31  review_scores_location            3093 non-null   float64
 32  review_scores_value               3092 non-null   float64
 33  instant_bookable                  3723 non-null   object
 34  cancellation_policy               3723 non-null   object
 35  require_guest_profile_picture     3723 non-null   object
 36  require_guest_phone_verification  3723 non-null   object
dtypes: float64(15), int64(6), object(16)
memory usage: 1.1+ MB

In [66]:
#hanya untuk eda kita hapus kolom id di kedua dataframe
df1_without_id = df1.drop(columns=['listing_id'])
df2_without_id = df2.drop(columns=['listing_id'])

In [68]:
# Mengambil kolom numerik dari df1_without_id
nums1 = df1_without_id.select_dtypes(include=['float64', 'int32', 'int64'])

# Mengambil kolom kategorikal dari df2_without_id
cats2 = df2_without_id.select_dtypes(include=['object'])

# Mengambil kolom numerik dari df2_without_id
nums2 = df2_without_id.select_dtypes(include=['float64', 'int64'])

In [72]:
# Mencetak judul kolom dari DataFrame nums1
print("\nKolom numerik (nums1):")
print(nums1.columns.tolist())

# Mencetak judul kolom dari DataFrame cats2
print("Kolom kategorikal (cats2):")
print(cats2.columns.tolist())

# Mencetak judul kolom dari DataFrame nums2
print("Kolom kategorikal (nums2):")
print(nums2.columns.tolist())

Kolom numerik (nums1):
['tahun', 'bulan_num', 'median_price', 'jumlah_id']
Kolom kategorikal (cats2):
['name', 'host_id', 'host_response_time', 'host_is_superhost', 'host_identity_verified', 'zipcode', 'latitude', 'longitude', 'is_location_exact', 'property_type', 'room_type', 'bed_type', 'instant_bookable', 'cancellation_policy', 'require_guest_profile_picture', 'require_guest_phone_verification']
Kolom kategorikal (nums2):
['jumlah_id', 'host_response_rate', 'host_acceptance_rate', 'accommodates', 'bathrooms', 'bedrooms', 'beds', 'price', 'weekly_price', 'monthly_price', 'guests_included', 'minimum_nights', 'maximum_nights', 'review_scores_rating', 'review_scores_accuracy', 'review_scores_cleanliness', 'review_scores_checkin', 'review_scores_communication', 'review_scores_location', 'review_scores_value']

In [74]:
df1.head()

   listing_id  tahun     bulan  bulan_num  median_price  jumlah_id
3        3335   2016  February          2         120.0          1
6        3335   2016     March          3         120.0         31
0        3335   2016     April          4         120.0         30
7        3335   2016       May          5         120.0         31
5        3335   2016      June          6         120.0         30

In [76]:
df2.head()

,listing_id,jumlah_id,name,host_id,host_response_time,host_response_rate,host_acceptance_rate,host_is_superhost,host_identity_verified,zipcode,...,review_scores_accuracy,review_scores_cleanliness,review_scores_checkin,review_scores_communication,review_scores_location,review_scores_value,instant_bookable,cancellation_policy,require_guest_profile_picture,require_guest_phone_verification
0,3335,309,Sweet Seattle Urban Homestead 2 Bdr,4193,within a few hours,88.0,100.0,f,t,98118,...,NaN,NaN,NaN,NaN,NaN,NaN,f,strict,f,f
1,4291,365,Sunrise in Seattle Master Suite,35749,within a day,100.0,100.0,f,t,98115,...,10.0,9.0,10.0,9.0,9.0,9.0,f,moderate,f,f
2,5682,309,"Cozy Studio, min. to downtown -WiFi",8993,within an hour,100.0,100.0,f,t,98106,...,10.0,10.0,10.0,10.0,9.0,10.0,t,strict,f,t
3,6606,365,"Fab, private seattle urban cottage!",14942,within a few hours,90.0,100.0,f,t,98103,...,9.0,9.0,10.0,9.0,10.0,9.0,f,strict,f,f
4,7369,53,launchingpad/landingpad,19425,NaN,NaN,NaN,f,f,98122,...,10.0,10.0,10.0,10.0,10.0,9.0,f,flexible,f,f

# EDA

## Descriptive Analysis

### df1

In [91]:
# Mengecek data yang kosong ada berapa 
df1.isna().sum()

listing_id      0
tahun           0
bulan           0
bulan_num       0
median_price    0
jumlah_id       0
dtype: int64

In [93]:
df1.describe()

         listing_id         tahun     bulan_num  median_price     jumlah_id
count  3.611500e+04  36115.000000  36115.000000  36115.000000  36115.000000
mean   5.350481e+06   2016.081157      5.979648    135.799059     25.876838
std    2.974416e+06      0.273080      3.663468    103.634732      9.364524
min    3.335000e+03   2016.000000      1.000000     20.000000      1.000000
25%    2.933877e+06   2016.000000      3.000000     75.000000     28.000000
50%    5.691933e+06   2016.000000      6.000000    105.000000     30.000000
75%    7.915432e+06   2016.000000      9.000000    158.000000     31.000000
max    1.034016e+07   2017.000000     12.000000   1650.000000     31.000000

### df2

In [95]:
#Mengecek data kosong ada berapa 
df2.isna().sum()

listing_id                             0
jumlah_id                              0
name                                   0
host_id                                0
host_response_time                   480
host_response_rate                   480
host_acceptance_rate                 723
host_is_superhost                      2
host_identity_verified                 2
zipcode                                7
latitude                               0
longitude                              0
is_location_exact                      0
property_type                          1
room_type                              0
accommodates                           0
bathrooms                             16
bedrooms                               6
beds                                   1
bed_type                               0
price                                  0
weekly_price                        1750
monthly_price                       2231
guests_included                        0
minimum_nights                         0
maximum_nights                         0
review_scores_rating                 622
review_scores_accuracy               633
review_scores_cleanliness            628
review_scores_checkin                633
review_scores_communication          626
review_scores_location               630
review_scores_value                  631
instant_bookable                       0
cancellation_policy                    0
require_guest_profile_picture          0
require_guest_phone_verification       0
dtype: int64

In [148]:
df2.describe().T

,count,mean,std,min,25%,50%,75%,max
listing_id,3723.0,5.548051e+06,2.969790e+06,3335.0,3242426.0,6119821.0,8036802.5,10340165.0
jumlah_id,3723.0,2.510185e+02,1.221197e+02,1.0,139.0,313.0,360.0,365.0
host_response_rate,3243.0,9.485446e+01,1.192436e+01,17.0,98.0,100.0,100.0,100.0
host_acceptance_rate,3000.0,9.996667e+01,1.825742e+00,0.0,100.0,100.0,100.0,100.0
accommodates,3723.0,3.333065e+00,1.965514e+00,1.0,2.0,3.0,4.0,16.0
bathrooms,3707.0,1.256811e+00,5.876989e-01,0.0,1.0,1.0,1.0,8.0
bedrooms,3717.0,1.297821e+00,8.734994e-01,0.0,1.0,1.0,2.0,7.0
beds,3722.0,1.728641e+00,1.133868e+00,1.0,1.0,1.0,2.0,15.0
price,3723.0,1.269930e+02,8.851005e+01,20.0,75.0,100.0,150.0,1000.0
weekly_price,1973.0,7.877248e+02,5.340506e+02,100.0,455.0,650.0,950.0,6300.0
monthly_price,1492.0,2.604684e+03,1.724225e+03,500.0,1507.5,2200.0,3100.0,19500.0
guests_included,3723.0,1.658340e+00,1.295365e+00,0.0,1.0,1.0,2.0,15.0
minimum_nights,3723.0,2.365565e+00,1.650437e+01,1.0,1.0,2.0,2.0,1000.0
maximum_nights,3723.0,7.859063e+02,1.702451e+03,1.0,60.0,1125.0,1125.0,100000.0
review_scores_rating,3101.0,9.454853e+01,6.620007e+00,20.0,93.0,96.0,99.0,100.0
review_scores_accuracy,3090.0,9.636246e+00,6.998914e-01,2.0,9.0,10.0,10.0,10.0
review_scores_cleanliness,3095.0,9.560582e+00,7.943707e-01,3.0,9.0,10.0,10.0,10.0
review_scores_checkin,3090.0,9.788350e+00,5.944549e-01,2.0,10.0,10.0,10.0,10.0
review_scores_communication,3097.0,9.809493e+00,5.682152e-01,2.0,10.0,10.0,10.0,10.0
review_scores_location,3093.0,9.607824e+00,6.310453e-01,4.0,9.0,10.0,10.0,10.0
review_scores_value,3092.0,9.453428e+00,7.494835e-01,2.0,9.0,10.0,10.0,10.0

## Univariate Analysis

### df1

### df2

## Multivariate Analysis

### df1

### df2